tap "alexanderwillner/tap"
tap "dart-lang/dart"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "iveney/mocha"
tap "sass/sass"
tap "thoughtbot/formulae"
tap "universal-ctags/universal-ctags"
# Automatic configure script builder
brew "autoconf"
# Shell extension to jump to frequently used directories
brew "autojump"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Programmable completion for Bash 3.2
brew "bash-completion"
# FSF/GNU ld, ar, readelf, etc. for native development
brew "binutils", link: true
# Dependency Manager for PHP
brew "composer"
# GNU File, Shell, and Text utilities
brew "coreutils"
# File comparison utilities
brew "diffutils"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# GNU Emacs text editor
brew "emacs"
# Modern replacement for 'ls'
brew "exa"
# Identify or delete duplicate files
brew "fdupes"
# Utility to determine file types
brew "file-formula"
# Collection of GNU find, xargs, and locate
brew "findutils"
# Command-line fuzzy finder written in Go
brew "fzf"
# Library for command-line editing
brew "readline"
# GNU awk utility
brew "gawk"
# GNU debugger
brew "gdb"
# Interpreter for PostScript and PDF
brew "ghostscript"
# Distributed revision control system
brew "git"
# Command-line option parsing library
brew "gnu-getopt"
# AVH edition of git-flow
brew "git-flow-avh"
# C code prettifier
brew "gnu-indent"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# GNU version of the tar archiving utility
brew "gnu-tar"
# GNU implementation of which utility
brew "gnu-which", args: ["with-default-names"]
# Apply a diff file to an original
brew "gpatch"
# GNU grep, egrep and fgrep
brew "grep", args: ["with-default-names"]
# Popular GNU data compression program
brew "gzip"
# SSL/TLS cryptography library
brew "openssl"
# Website copier/offline browser
brew "httrack"
# Add GitHub support to git on the command-line
brew "hub"
# Generic library support script
brew "libtool"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Pager program similar to more
brew "less"
# C XSLT library for GNOME
brew "libxslt"
# YAML Parser
brew "libyaml"
# Swiss Army Knife for macOS
brew "m-cli"
# Macro processing language
brew "m4"
# Interpreted, interactive, object-oriented programming language
brew "python"
# Keep your Mac's application settings in sync
brew "mackup"
# GUI for vim, made for macOS
brew "macvim", args: ["with-override-system-vim"]
# Utility for directing compilation
brew "make"
# Mac App Store command-line interface
brew "mas"
# High-performance, schema-free, document-oriented database
brew "mongodb", restart_service: true
# CLI for MySQL with auto-completion and syntax highlighting
brew "mycli"
# Open source relational database management system
brew "mysql"
# Node version management
brew "n", link: false
# Platform built on V8 to build network applications
brew "node", link: false
# Platform built on V8 to build network applications
brew "node@8"
# OpenBSD freely-licensed SSH connectivity tools
brew "openssh"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Object-relational database system
brew "postgresql", restart_service: true
# Monitor data's progress through a pipe
brew "pv"
# Reattach process (e.g., tmux) to background
brew "reattach-to-user-namespace"
# Persistent key-value database, with built-in net interface
brew "redis", restart_service: true
# Terminal multiplexer with VT100/ANSI terminal emulation
brew "screen"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Autoformat shell script source code
brew "shfmt"
# Command-line interface for https://speedtest.net bandwidth tests
brew "speedtest-cli"
# Tool Command Language
brew "tcl-tk"
# Code-search similar to ack
brew "the_silver_searcher"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# ODBC 3 connectivity for UNIX
brew "unixodbc"
# Vi 'workalike' with many additional features
brew "vim", link: false
# Executes a program periodically, showing output fullscreen
brew "watch"
# Watch files and take action when they change
brew "watchman"
# Display word differences between text files
brew "wdiff"
# Internet file retriever
brew "wget"
# JavaScript package manager
brew "yarn"
# UNIX shell (command interpreter)
brew "zsh"
# Additional completion definitions for zsh
brew "zsh-completions"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# Everything you need to get started with Heroku
brew "heroku/brew/heroku"
brew "iveney/mocha/realpath", link: false
brew "thoughtbot/formulae/parity"
# management suite for dotfiles
brew "thoughtbot/formulae/rcm"
# Maintained ctags implementation
brew "universal-ctags/universal-ctags/universal-ctags", args: ["HEAD"]
cask "asset-catalog-tinkerer"
cask "cakebrew"
cask "font-hack-nerd-font"
cask "gpg-suite"
cask "imageoptim"
cask "sublime-text"
mas "1Password 7", id: 1333542190
mas "Agenda", id: 1287445660
mas "Airmail 3", id: 918858936
mas "Amphetamine", id: 937984704
mas "Aware", id: 1082170746
mas "Bear", id: 1091189122
mas "Binaural", id: 946812450
mas "Boom 2", id: 948176063
mas "Byword", id: 420212497
mas "Chronicle 8", id: 1280542517
mas "Clear", id: 504544917
mas "Copied", id: 1026349850
mas "Countdown Timer Plus", id: 1150771803
mas "DaisyDisk", id: 411643860
mas "Day One", id: 1055511498
mas "dDNS Broker", id: 1050307950
mas "Disk Doctor", id: 455970963
mas "Doo", id: 1107759193
mas "Due", id: 524373870
mas "Encrypto", id: 935235287
mas "Evernote", id: 406056744
mas "Fantastical 2", id: 975937182
mas "FocusList", id: 1086877679
mas "Gestimer", id: 990588172
mas "Gifox", id: 1082624744
mas "Gladys", id: 1382386877
mas "GlucoGram", id: 1107429772
mas "Helium", id: 1054607607
mas "Highland 2", id: 1171820258
mas "Interact Scratchpad", id: 1199660222
mas "iStudiez Pro", id: 402989379
mas "Keynote", id: 409183694
mas "LoremBuilder", id: 683129651
mas "Mactracker", id: 430255202
mas "Magnet", id: 441258766
mas "Marked 2", id: 890031187
mas "MindNode", id: 1289197285
mas "MindNode Pro", id: 402398561
mas "Momentum", id: 1030442215
mas "MultiMarkdown Composer", id: 1275176220
mas "Newton", id: 1059655371
mas "Noizio", id: 928871589
mas "Novabench", id: 411466132
mas "Numbers", id: 409203825
mas "OhMyStar2", id: 1218642292
mas "OmniFocus", id: 867299399
mas "OmniOutliner", id: 1142578772
mas "Ora", id: 1340501510
mas "Pages", id: 409201541
mas "Paprika Recipe Manager", id: 451907568
mas "Planny", id: 1294511784
mas "Pocket", id: 568494494
mas "PopClip", id: 445189367
mas "Quiver", id: 866773894
mas "Reeder", id: 880001334
mas "Server", id: 883878097
mas "Silenz", id: 1126098076
mas "Spark", id: 1176895641
mas "Speedtest", id: 1153157709
mas "TaskPaper", id: 1090940630
mas "The Unarchiver", id: 425424353
mas "Things3", id: 904280696
mas "TickTick", id: 966085870
mas "Todoist", id: 585829637
mas "TODOs Menubar", id: 1383155669
mas "Trello", id: 1278508951
mas "Ulysses-old", id: 623795237
mas "UlyssesMac", id: 1225570693
mas "Unclutter", id: 577085396
mas "Unsplash Wallpapers", id: 1284863847
mas "Wake Up Time Pro", id: 516371849
mas "Xcode", id: 497799835
mas "Yoink", id: 457622435
